Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོད་དོ། །དེ་ཡང་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཆོས་དེ་ཐམས་ཅད་རྒྱ་ཆེར་བསྟན་ཏེ། དེ་ལ་བསླབས་ན་རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་ཡོད་དོ། །བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་ཡོད་དོ། །ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་ཡོད་དོ། །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཡོད་དོ། །སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་ཆུང་དགེ་དང་ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་ཆེ་བ་དང་། ཆུང་ཆེ་དང་ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་མི་ཆེ་བ་དང་མི་གདུང་བ་དང་ཤིན་དུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་།
en: Indeed, it is from this perfection of wisdom that all phenomena are extensively revealed.

source: འོག་མིན་གྱི་ལྷ་རྣམས་ཡོད་དོ། །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཆུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མྱིན་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཡོད་དོ། །རྒྱུན་དུ་ཞུགས་པ་རྣམས་ཡོད་དོ། །ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: Having trained in it, the great and lofty royal families are discerned; the great and lofty priestly families are discerned; the great and lofty householder families are discerned; the gods of the Caturmahā­rāja­kāyika realm are discerned; the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha are all discerned; and the gods of the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception are discerned. [

source: ཕྱིར་མི་འོང་བ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་ཡོད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡོད་དོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཡོད་དོ།
en: Having trained in it], these who have entered the stream to nirvāṇa are discerned; those who are destined for only one more rebirth, those who are no longer subject to rebirth, arhats, pratyekabuddhas, and bodhisattvas are discerned; and the tathāgatas, arhats, completely awakened buddhas are discerned.

source: །དེ་བས་ན་དེ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་རིན་པོ་ཆེ་ཞེས་བྱའོ།
en: For those reasons, this is designated as the precious perfection. “

source: །ཕ་རོལ་དུ་ཕྱིན་པ་རིན་པོ་ཆེ་དེ་ལ་ནི་ཆོས་གང་ཡང་སྐྱེ་བའམ། འགག་པའམ། ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བའམ། ཡོངས་སུ་གཟུང་བའམ།
en: In this precious perfection, there is nothing at all that arises or ceases, nothing that is defiled or purified, nothing that is to be retained or forsaken.

source: དོར་བ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་སྐྱེ་བའམ། འགག་པ་འམ། ཀུན་ནས་ཉོན་མོངས་པའམ།
en: If you ask why, it is because there is nothing at all that could arise or cease, nothing that could be defiled or purified, nothing that could be retained or forsaken.

source: རྣམ་པར་བྱང་བའམ། ཡོངས་སུ་གཟུང་བའམ། དོར་བར་བྱ་བའི་ཆོས་དེ་ལྟ་བུ་མེད་དོ། །རབ་འབྱོར་ཕ་རོལ་དུ་ཕྱིན་པ་རིན་པོ་ཆེ་འདི་ལ་ནི་དགེ་བའམ། མི་དགེ་བའམ།
en: Subhūti, in this precious perfection, there are no phenomena at all that are apprehensible, be they virtuous, nonvirtuous, {Ki.

source: འཇིག་རྟེན་པའམ། འཇིག་རྟེན་ལས་འདས་པའམ། ཟག་པ་དང་བཅས་པ་འམ་ཟག་པ་མེད་པའམ།
en: II-III: 183} mundane, supramundane, contaminated, uncontaminated, conditioned, or unconditioned.

source: འདུས་བྱས་སམ་འདུས་མ་བྱས་ཀྱི་ཆོས་གང་ཡང་དམིགས་སུ་མེད་དེ་རབ་འབྱོར་རྣམ་གྲངས་ངེས་ཀྱང་ཕ་རོལ་དུ་ཕྱིན་པ་རིན་པོ་ཆེ་ནི་དམིགས་སུ་མེད་དོ།
en: For this reason, Subhūti, this precious perfection is nonapprehensible. “

source: །རབ་འབྱོར་ཕ་རོལ་དུ་ཕྱིན་པ་རིན་པོ་ཆེ་ལ་ནི་གང་གིས་ཀྱང་འགོ་བ་མེད་དོ།
en: Subhūti, this precious perfection is unsullied by anything whatsoever.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་འགོ་བར་འགྱུར་བའི་ཆོས་དེ་ལྟ་བུ་དམིགས་སུ་མེད་དོ།
en: If you ask why, it is because the phenomena by which it might be sullied are nonapprehensible.

source: །རབ་འབྱོར་དེའི་ཕྱིར་ན་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འགོ་བ་མེད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རིན་པོ་ཆེ་འོ།
en: Subhūti, for that reason this perfection is [designated as] the precious perfection that is unsullied.

source: །རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དེ་ལྟར་འདུ་ཤེས་པར་ཡང་མི་བྱེད་ལ། དེ་ལྟར་མི་རྟོག་ཅིང་དེ་ལྟར་མི་དམིགས་ཏེ། དེ་ལྟར་འཕྲོ་བར་ཡང་མི་བྱེད་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་སྟེ།
en: Subhūti, if, when bodhisattva great beings are practicing the perfection of wisdom, they do not perceive in that manner, do not conceptualize in that manner, and do not elaborate in that manner, they are indeed practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྒོམ་པའོ།
en: They are cultivating the perfection of wisdom.

source: །དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཉེས་པར་བྱེད་པའོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མངོན་པར་བསམས་ཤིང་།
en: They please the lord buddhas.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་སྟེ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྤྱོད་པར་བྱེད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོའོ།
en: Thinking of the lord buddhas, they proceed from one buddhafield to another buddhafield in order to serve, respect, honor, and worship the lord buddhas; and when they proceed from one buddhafield to another buddhafield, they bring beings to maturity and refine the buddhafields. “

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཆོས་གང་ཡང་སྟོན་པའམ། རྣམ་པར་སྟོན་པའམ། ཡོངས་སུ་སྟོན་པའམ། འཛིན་པར་བྱེད་པའམ། འབྱིན་པར་བྱེད་པའམ། སྐྱེ་བར་བྱེད་པའམ། འགག་པར་བྱེད་པའམ། ཀུན་ནས་ཉོན་མོངས་པར་བྱེད་པའམ།
en: Subhūti, this perfection of wisdom does not teach, reveal, disclose, grasp, offer, produce, terminate, afflict, purify, diminish, or enhance anything at all; nor is it past, future, or present. “

source: རྣམ་པར་བྱང་བར་བྱེད་པའམ། འགྲིབ་པར་བྱེད་པའམ། འཕེལ་བར་བྱེད་པའམ། འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བར་བྱེད་པ་མེད་དོ། །རབ་འབྱོར་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འདོད་པའི་ཁམས་ལས་འདའ་བར་བྱེད་པ་མ་ཡིན།
en: Subhūti, this perfection of wisdom does not transcend the realm of desire, nor is it established in it.

source: གནས་པར་བྱེད་པ་མ་ཡིན། གཟུགས་ཀྱི་ཁམས་ལས་འདའ་བར་བྱེད་པ་མ་ཡིན།
en: It does not transcend the realm of form, nor is it established in it.

source: གནས་པར་བྱེད་པ་མ་ཡིན། གཟུགས་མེད་པའི་ཁམས་ལས་འདའ་བར་བྱེད་པ་མ་ཡིན།
en: It does not transcend the realm of formlessness, nor is it established in it.

source: གནས་པར་བྱེད་པ་མ་ཡིན། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents the perfection of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: ནང་སྟོང་པ་ཉིད་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents the emptiness of internal phenomena.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents the thirty-seven factors conducive to enlightenment.

source: འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, or the formless absorptions.

source: རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, or the extrasensory powers.

source: ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents the meditative stabilities or the dhāraṇī gateways.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་།
en: It neither brings about nor prevents the powers of the tathāgatas, {Ki.

source: མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: II-III: 184} the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, or the distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents the fruit of entering the stream to nirvāṇa.

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, or arhatship.

source: རང་བྱང་ཆུབ་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents individual enlightenment.

source: ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་སྒྲུབ་པ་མ་ཡིན་འདོར་བ་མ་ཡིན།
en: It neither brings about nor prevents knowledge of the path.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྒྲུབ་པ་མ་ཡིན། འདོར་བ་མ་ཡིན་ནོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཞི་བཅུ་གཅིག་པ།
en: It neither brings about nor prevents all-aspect omniscience. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འདུས་བྱས་ཀྱི་ཁམས་འདོར་བ་མ་ཡིན། འདུས་མ་བྱས་ཀྱི་ཁམས་སྒྲུབ་པ་མ་ཡིན་ནོ།
en: This perfection of wisdom does not prevent the conditioned elements, nor does it bring about the unconditioned elements.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། དེ་བཞིན་གཤེགས་པ་རྣམས་མ་བྱུང་ཡང་རུང་། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་།
en: If you ask why, it is because, regardless of whether the tathāgatas have appeared or not, it dwells as the reality of all phenomena, the realm of phenomena, the abiding nature of reality, and maturity with respect to all phenomena.

source: ཆོས་སྐྱོན་མེད་པ་དེ་ནི་དེ་བཞིན་དུ་གནས་པ་ཡིན་ཏེ་དེ་ནི་དེ་བཞིན་གཤེགས་པས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་ཐུགས་སུ་ཆུད་དོ།
en: That is the consummate buddhahood attained by the tathāgatas.

source: །མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། མངོན་པར་རྫོགས་པར་ཐུགས་སུ་ཆུད་ནས་ཀྱང་གསུང་ངོ་། །སྟོན་ཏོ། །རྗོད་དོ། །འགྲེལ་ཏོ།
en: Comprehending it, they attain consummate buddhahood, and having manifestly comprehended that, they describe, teach, interpret, analyze, elucidate, and reveal it.”

source: །རྣམ་པར་འབྱེད་དོ། །གསལ་བར་མཛད་དོ། །ཡང་དག་པར་སྟོན་ཏོ། །དེ་ནས་ལྷའི་བུ་སྟོང་ཕྲག་མང་པོ་སྟེང་གི་བར་སྣང་ལ་འཁོད་ནས་ལྷུང་ལྷུང་ལྡེགས་ཀྱི་སྒྲ་ཕྱུང་སྟེ།
en: Then many thousands of gods, congregating in the midst of the heavens, cheered long and loud.

source: ལྷ་རྫས་ཀྱི་མེ་ཏོག་ཨུཏྤ་ལ་དང་། པད་མོ་དང་། ཀུ་མུད་དང་། པུནད་རི་ཀ་དང་། མཱན་དཱ་ར་བ་དང་།
en: They scattered their divine flowers—blue lotuses, day lotuses, night lotuses, white lotuses, coral flowers, and large coral flowers—and they said, “Ah!

source: མཱན་དཱ་ར་བ་ཆེན་པོ་འཐོར་ཞིང་འདི་སྐད་ཀྱི་ཚིག་བརྗོད་པར་གྱུར་ཏོ། །ཀྱེ་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བསྟན་པས། ལྷའི་བུ་སྟོང་ཕྲག་དུ་མ་སྐྱེ་བ་མེད་པའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་པར་གྱུར་ཏེ།
en: Through the teaching of this perfection of wisdom, many thousands of gods have accepted that phenomena are nonarising.

source: འཛམ་བུའི་གླིང་དུ་ཆོས་ཀྱི་འཁོར་ལོ་གཉིས་པ་བསྐོར་བ་མཐོང་ངོ་།
en: We have seen the wheel of the Dharma turned for the second time in Jambudvīpa!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནས་བརྟན་རབ་འབྱོར་ལ་བཀའ་སྩལ་པ། རབ་འབྱོར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། འདི་ནི་ཆོས་ཀྱི་འཁོར་ལོ་གཉིས་སུ་བསྐོར་བ་ཡང་མ་ཡིན། གཅིག་ཏུ་བསྐོར་བ་ཡང་མ་ཡིན་ནོ།
en: Then the Blessed One addressed the elder Subhūti: “Subhūti, owing to the emptiness of the essential nature of nonentities, this turning of the wheel of the Dharma is not the first [in Jambudvīpa], nor is it the second.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡང་ཆོས་གང་ཡང་འཁོར་བའམ། མི་འཁོར་བར་བྱ་བའི་ཕྱིར་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ། །གསོལ་པ།
en: This perfection of wisdom is not at all established as a doctrine that is to be set in motion or not set in motion.” “

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཆོས་གང་ཡང་འཁོར་བར་བགྱི་བའམ། མི་འཁོར་བར་བགྱི་བའི་སླད་དུ། ཉེ་བར་མི་གནས་པའི་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དེ་གང་ལགས།
en: Blessed Lord, what is the emptiness of the essential nature of nonentities, owing to which this perfection of wisdom is not at all established as a doctrine to be set in motion or not set in motion?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་ངོ་།
en: Subhūti,” replied the Blessed One, “the perfection of wisdom is empty of the perfection of wisdom.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་ངོ་།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are empty of the perfection of generosity [and so forth].

source: །ནང་སྟོང་པ་ཉིད་ནང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: The emptiness of internal phenomena is empty of the emptiness of internal phenomena. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are empty of the emptiness of the essential nature of nonentities [and so forth]. “

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱིས་སྟོང་ངོ་། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: The applications of mindfulness are empty of the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱ་དཔས་སྟོང་ངོ་། །འཕགས་པའི་བདེན་པ་རྣམས་དང་།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are empty of the noble eightfold path [and so forth]. {

source: བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: Ki.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་མངོན་པར་ཤེས་པ་རྣམས་ཀྱིས་སྟོང་ངོ་།
en: II-III: 185} The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are empty of the extrasensory powers [and so forth].

source: །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱིས་སྟོང་ངོ་། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་།
en: The meditative stabilities and the dhāraṇī gateways are empty of the dhāraṇī gateways [and so forth].

source: མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱིས་སྟོང་ངོ་།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas are empty of the distinct qualities of the buddhas [and so forth]. “

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུས་སྟོང་ངོ་།
en: The fruit of entering the stream to nirvāṇa is empty of the fruit of entering the stream to nirvāṇa.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཕྱིར་མི་འོང་བའི་འབྲས་བུས་སྟོང་ངོ་།
en: The fruit of being destined for only one more rebirth and the fruit of no longer being subject to rebirth are empty of the fruit of no longer being subject to rebirth [and so forth].

source: །དགྲ་བཅོམ་པ་ཉིད་དགྲ་བཅོམ་པ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: Arhatship is empty of arhatship.

source: །རང་བྱང་ཆུབ་རང་བྱང་ཆུབ་ཀྱིས་སྟོང་ངོ་།
en: Individual enlightenment is empty of individual enlightenment.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: Knowledge of the path is empty of knowledge of the path.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་སྟོང་ངོ་། །གསོལ་པ།
en: All-aspect omniscience is empty of all-aspect omniscience.” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཆེན་མོ་སྟེ། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རང་བཞིན་གྱིས་སྟོང་པའོ།
en: Blessed Lord, this perfection of wisdom that bodhisattva great beings have is great, for the perfection of wisdom is empty of inherent existence.

source: །དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ཡང་། ཆོས་གང་ཡང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་མཆིས།
en: This implies that all phenomena are empty of all phenomena, and although bodhisattva great beings dwell in the perfection of wisdom and attain consummate buddhahood in unsurpassed, complete enlightenment, there is nothing at all that attains consummate buddhahood.

source: ཆོས་ཀྱི་འཁོར་ལོ་ཡང་བསྐོར་ལ་ཆོས་གང་ཡང་འཁོར་བའམ་མི་འཁོར་བའམ་རབ་ཏུ་འཁོར་བར་བགྱིད་པ་མ་མཆིས་ཏེ།
en: Although they indeed turn the wheel of the Dharma, there is nothing at all that is set in motion, not set in motion, or further set in motion.

source: དེ་དག་གིས་ཆོས་གང་ཡང་ཡོངས་སུ་མཐོང་བའམ་ཡོངས་སུ་མ་མཐོང་བ་མ་མཆིས་སོ།
en: There is nothing at all that they see or do not see.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་འཁོར་བར་བགྱི་བའམ་མི་འཁོར་བར་བགྱི་བའམ་རབ་ཏུ་འཁོར་བར་བགྱི་བའི་ཆོས་དེ་ལྟ་བུ་དམིགས་སུ་མ་མཆིས་ཏེ།
en: If one were to ask why, it is because anything that set it in motion, did not set it in motion, or further set it in motion cannot be apprehended.

source: དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱང་ཤིན་དུ་མངོན་པར་མ་གྲུབ་པའོ།
en: If one were to ask why, it is because all phenomena are absolutely not brought into being.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། སྟོང་པ་ཉིད་ནི་འཁོར་བར་བགྱིད་པའམ། མི་འཁོར་བར་བགྱིད་པ་མ་ལགས་སོ།
en: If one were to ask why, it is because emptiness does not set in motion or not set in motion anything at all.

source: །མཚན་མ་མ་མཆིས་པ་ནི་འཁོར་བར་བགྱིད་པའམ་མི་འཁོར་བར་བགྱིད་པ་མ་ལགས་སོ།
en: Signlessness does not set in motion or not set in motion anything at all.

source: །སྨོན་པ་མ་མཆིས་པ་ནི་འཁོར་བར་བགྱིད་པའམ་མི་འཁོར་བར་བགྱིད་པ་མ་ལགས་སོ། །དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པ་དང་།
en: Wishlessness does not set in motion or not set in motion anything at all.

source: རབ་ཏུ་བསྟན་པ་དང་། བསྒྲགས་པ་དང་རབ་ཏུ་དགོད་པ་དང་གཞག་པ་དང་། རྣམ་པར་དབྱེ་བ་དང་། རྣམ་པར་དགྲོལ་བ་དང་སྨོས་པ་དང་། གསལ་བར་བགྱི་བ་དང་ཡང་དག་པར་བསྟན་པ་འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པ་ཡོངས་སུ་དག་པའོ།
en: That which describes, explains, proclaims, establishes, posits, analyzes, interprets, mentions, elucidates, introduces, and reveals the perfection of wisdom in this manner is the absolutely pure exposition of the perfection of wisdom.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པ་དེ་ཡང་སུས་ཀྱང་མ་བསྟན་སུས་ཀྱང་མ་བཟུང་ངོ་།
en: This exposition of the perfection of wisdom has neither been explained by anyone at all, nor has it been grasped by anyone at all.

source: །གང་སུས་ཀྱང་མ་བསྟན་སུས་ཀྱང་མ་བཟུང་བ་དེ་ནི་སུས་ཀྱང་མངོན་དུ་མ་བགྱིས་སོ།
en: That which has neither been explained by anyone at all, nor grasped by anyone at all has not been brought into being by anyone at all.

source: །གང་སུས་ཀྱང་མངོན་དུ་མ་བགྱིས་པ་དེ་ལ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མ་མཆིས་ཏེ།
en: For that which has not been brought into being by anyone at all, there is no passing into final nirvāṇa.

source: ཆོས་བསྟན་པ་འདི་ལ་གང་སུ་ཡང་སྦྱིན་པའི་གནས་སུ་འགྱུར་བ་མ་མཆིས་སོ།
en: Nor is there anyone at all who is worthy of offerings on account of this exposition of the Dharma.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་ཉི་ཤུ་བརྒྱད་པའོ།། །།
en: This completes the twenty-eighth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.” Chapter 29 {Ki.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: IV: 1} Then the venerable Subhūti said to the Blessed One, “Blessed Lord, this perfection of wisdom is the perfection that is nonexistent.” “

source: ནམ་མཁའ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonexistence of space!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མཉམ་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is sameness.” “

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the sameness of all phenomena!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ།
en: replied the Blessed One. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རྣམ་པར་དབེན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is void.” “

source: མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to emptiness, beyond limitations!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཐུབ་པ་མེད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is invincible.” “

source: ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་གནས་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is baseless.” “

source: མིང་དང་ལུས་མེད་པའི་ཕྱིར་རོ།
en: This is owing to namelessness and noncorporeality!”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ།
en: replied the Blessed One. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ནམ་མཁའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection is the perfection like space.” “

source: དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonexistence of the exhalation and inhalation of breath!”

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ།
en: replied the Blessed One. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བརྗོད་དུ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is inexpressible.” “

source: རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of ideation and scrutiny!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མིང་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is nameless.” “

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of feelings, perceptions, formative predispositions, and consciousness!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འགྲོ་བ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is unmoving.” “

source: ཆོས་ཐམས་ཅད་འགྲོ་བ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonmoving of all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མི་འཕྲོགས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that cannot be appropriated.” “
